IDEA Open Model
ThermalStrainState Enumeration
Compatible with IDEA StatiCa v 10.1
 Type of curvature - thermal strain curvature
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public enum ThermalStrainState
Public Enumeration ThermalStrainState
public enum class ThermalStrainState
Members
Member name | Value | Description
None | 0 |  The curvature is not defined
Code | 1 |  The curvatire is defined by the code
User | 5 |  The curvature is input by the user
See Also
Reference
IdeaRS.OpenModel.Material Namespace